tutorials/multiphaseReactiveTransport/interReactiveTransferFoam/2DCavity/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Yi 
    {
        solver          BICCG;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
    }
    

    YiFinal
    {
        $Yi;
    }

    pcorr
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.00001;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pd 
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pdFinal
    {
        $pd;
        tolerance       1e-7;
        relTol          0;
    }

    pc
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
    }
}

PISO
{
    cAlpha 1;
    cYi    1;
}

PIMPLE
{
    pRefCell 0;
    pRefValue 0;
    pdRefCell 0;
    pdRefValue 0;
    pcRefCell 0;
    pcRefValue 0;
    cSK 0;
    nSK 0;
    cPc  0; 

    momentumPredictor no;
    nCorrectors     3;
    nOuterCorrectors    1;
    nNonOrthogonalCorrectors 0;
    nAlphaCorr      1;
    nAlphaSubCycles 1;
}
 

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

cache
{
  grad(U);
  grad(p);
}
// ************************************************************************* //
